tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

cask_args appdir: "/Applications"

tap "txn2/tap"
tap "wix/brew"
tap "AdoptOpenJDK/openjdk"

### General

brew "git"
brew "cloc"
brew "asdf" # yarn, elixir, helm, kubectl
# brew "neovim"
brew "gpg"

### Mobile
brew "coreutils"
brew "watchman"
brew "wix/brew/applesimutils"
# brew "yarn"

### Backend

brew "aws-iam-authenticator"
# brew "helm"
# brew "kubernetes-cli"
brew "kubectx"
brew "txn2/tap/kubefwd"
brew "awscli"

## Cask Installed Applications

### Required

cask "google-chrome"
cask "iterm2"
cask "slack"
cask "1password"
cask "visual-studio-code"
cask "adoptopenjdk8"

### Divvy General

cask "zoomus"
cask "tunnelblick"
cask "jetbrains-toolbox"
cask "notion"

### Divvy Backend

cask "docker"

### Divvy Frontend

cask "figma"
cask "react-native-debugger"
cask "graphql-playground"
# cask "reactotron"

### Optional

cask "daisydisk"
cask "deckset"
cask "flipper"
cask "kaleidoscope"
cask "paw"
cask "tower"
cask "charles"
# cask "kitematic"

## MAS Installed Applications

mas "Xcode", id: 497799835
mas "Asset Catalog Creator Pro", id: 809625456
mas "BetterSnapTool", id: 417375580
mas "Keynote", id: 409183694
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
# mas "Jira Cloud by Atlassian", id: 1475897096
# mas "Twitter", id: 1482454543
